//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    main.h
* @author  CMS_Motor_Control_Team
* @version 第三代电机平台
* @date    2024年6月
* @brief   
*---------------------------------------------------------------------------//
*****************************************************************************/

//==========================================================================//

#ifndef __ALGOR_OB2_H
#define __ALGOR_OB2_H

/*****************************************************************************/
/* Include files */
/*****************************************************************************/
#include <stdint.h>


#include "MC_FOC.h"
#include "MC_PID.h"

/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define') */
/*****************************************************************************/


/*****************************************************************************/
/* Global type definitions ('typedef') */
/*****************************************************************************/

typedef struct 
{
//Alpha  Beta轴电流和电压
  int32_t Ialpha;
  int32_t Ibeta;
  int32_t Ualpha;
  int32_t Ubeta;
  
  
  int32_t Omega;             
  int32_t OmegaPu;            
  int16_t Theta;              
  Struct_Sincos SinCos;       
  
  

  int32_t Sig1;             
  int32_t Sig2;             
  int32_t Sig3;             
  int32_t Sig4;             

  int32_t Sig5;             
  int32_t Sig6;            
  int32_t Sig7;            
  int32_t Sig8;          

  int32_t Sig9;                      
  int32_t Sig10;          
  int32_t Sig11;         
  int32_t Sig12;            

  int32_t Sig13;           
  int32_t Sig14;          
  
  int32_t Sig15;         
  int32_t Sig16;          

  int32_t g1;                   
  int32_t g2;                     
	
  int32_t g3;                    
  int32_t g4;                     

  int32_t k1;
  int32_t k2;
}Struct_Ob2;




/*****************************************************************************/
/* Global variable declarations ('extern', definition in C source) */
/*****************************************************************************/

extern Struct_Ob2 Stru_Ob2;                //观测器结构体
extern Struct_PI  Algor_PI2;

/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source) */
/*****************************************************************************/

void Ob2_Init(void);
void Ob2_Cal(void);
void Ob2_ParaRefresh(int32_t Kp,int32_t ki,int32_t Upper,int32_t Lower);
void Ob2_ParaReset(void);
void Switch2Ob2(int16_t Theta,int32_t omega);

/*****************************************************************************/
/* Intrinsic function definition ('__inline', definition in Header File) */
/*****************************************************************************/


/*****************************************************************************/
/* Macro Definition function definition ( definition in Header File) */
/*****************************************************************************/



#endif

/******************************** END OF FILE *******************************/



