//===========================================================================//
/*****************************************************************************/
//---------------------------------------------------------------------------//
/** \file
*  File Name  : Set_SPEED.h
*  Author     : CMS_Motor_Control_Team
*  Version    : 第二代风机软件平台
*  Date       : 09/01/2022
*  Description: 本页参数为电机调速控制相关参数，
								包括但不限于：最大转速、功率、调速方式等
**             
//---------------------------------------------------------------------------//
******************************************************************************/

//===========================================================================//
#ifndef __Set_SPEED_H
#define __Set_SPEED_H


//============================================================================/
// 代码对齐方式：Edit--Configuration--Editor--C/C++Files--Tab size = 2
//----------------------------------------------------------------------------/

//===========================================================================//

//-------------------------------速度调节方式----------------------------------/
// 
#define		PWM_Control														(0)											// PWM占空比信号调速
#define		VSP_Control														(1)                     // 电压信号调速
#define		CLK_Control														(2)                     // 频率信号调速
#define		Debug_Control													(3)                     // 调试用，给固定值
#define		Speed_Govern_Mode											(Debug_Control)


//-------------------------------调试模式下目标值--------------------------------/
// 电流环：最小与最大目标值为相电流，单位：A，
// 速度环：最小与最大目标值为转速 	 单位：r/min，
// 功率环：最小与最大目标值为功率		 单位：W
// 母线电流环：最小与最大目标值为母线电流		 单位：A
#define   DEBUG_TARGET													(2000)									// 调试模式下，控制目标值

//-------------------------------PWM捕获模块配置------------------------------------/
// 调速信号捕获
#define		CCP_Capture_Disable										(0)                     // 捕获功能关闭
#define		CCP_Capture_Enable										(1)                     // 捕获功能开启
#define		Config_CCP_Capture										(CCP_Capture_Disable)

#define		CCP_CAPTURE_MODULE										(CCP1)                  // 捕获的模块 CCP0、CCP1
#define		CCP_PWM_PORT													(PORT0)									// PWM输入端口
#define		CCP_PWM_PIN														(PIN4)									// PWM输入引脚

//--------------------------------FG输出----------------------------------------/
// FG信号输出，需改动函数 User_Speed_Out 中IO口输出
#define		CCP_PWM_Disable												(0)                     // FG输出功能关闭
#define		CCP_PWM_Enable												(1)                     // FG输出功能开启
#define		Config_CCP_PWM												(CCP_PWM_Disable)

#define		CCP_PWM_MODULE												(CCP0)                  // FG的模块 CCP0、CCP1
#define		CCP_PWM_CH														(CCPxB)                 // FG的通道 CCPxA、CCPxB

//--------------------------------调速范围设置-------------------------------------//
//  PWM频率速度控制
#define		PWM_FRE_OFF														(500)									// 停止电压点 单位：0.1Hz
#define		PWM_FRE_ON														(600)    							// 启动电压点 单位：0.1Hz
#define		PWM_FRE_MAX														(3000)									// 最大电压点 单位：0.1Hz

// PWM占空比速度控制
#define		PWM_DUTY_STOP													(70)										// 停止占空比 单位：0.1%
#define		PWM_DUTY_START												(100)										// 启动占空比 单位：0.1%
#define		PWM_DUTY_MAX													(900)										// 最大占空比 单位：0.1%

// VSP速度控制
#define		VSP_REF_OFF														(0.6)									// 停止电压点 单位：V
#define		VSP_REF_ON														(0.8)    							// 启动电压点 单位：V
#define		VSP_REF_MAX														(4.5)									// 最大电压点 单位：V

//--------------------------------调速目标设置-----------------------------------------//
// 电流环：最小与最大目标值为相电流，单位：A，
// 速度环：最小与最大目标值为转速 	 单位：r/min，
// 功率环：最小与最大目标值为功率		 单位：W
// 母线电流环：最小与最大目标值为母线电流		 单位：A

//---------------------------------------------------------------------------/
// 最大运行值、最小运行值，适用于直线控制
#define		Target_START													(200)										// 最小目标值
#define		Target_MAX														(2000)									// 最大目标值

//---------------------------------------------------------------------------/
// 多段折线控制
#define		Table_LookUp_En												(0)											// 通过查表控制目标转速、功率
																																				// 完善表格 SpeedCtrl_Map
//--------------------------------外环控制方式-------------------------------------------//
// 外环设置
#define		Current_Loop													(0)											// 电流环                      
#define		Speed_Loop														(1)											// 速度环                     
#define		Power_Loop														(2)											// 功率环       
#define		Ibus_Loop															(3)											// 母线电流环
#define		Config_OutLoop_Mode										(Speed_Loop)

// 外环执行周期
#define  TIME_SPEED_LOOP												(1)											// 速度环执行周期 单位：ms
#define  TIME_POWER_LOOP												(1)                     // 功率环执行周期 单位：ms

//功率环PI参数 
#define   POWER_KP															_Q12(0.5)								// Q轴PI参数：Kp                               
#define   POWER_KI															_Q15(0.005)							// Q轴PI参数：Ki                              

//速度环PI参数 
#define   SPEED_KP															_Q12(0.5)								// Q轴PI参数：Kp                               
#define   SPEED_KI															_Q15(0.004)						// Q轴PI参数：Ki                              
                           

//---------------------------------------------------------------------------//
//用户指令（标幺值）斜率 
#define  SPEED_RAMP_INC													(1)										// 速度爬坡曲线，加速斜率
#define  SPEED_RAMP_DEC													(1)										// 速度爬坡曲线，下降斜率

//---------------------------------运行最大值参数设置--------------------------//

// 相电流最大、最小值
#define  IPHASE_MIN												(-4.0)             			// 电机运行最小相电流峰值 单位：A
#define  IPHASE_MAX                				(4.0)              			// 电机运行最大相电流峰值 单位：A

#endif

/******************************** END OF FILE *******************************/

