//===========================================================================//
/*****************************************************************************/
//---------------------------------------------------------------------------//
/** \file
*  File Name  : Set_FOC.h
*  Author     : CMS_Motor_Control_Team
*  Version    : 第二代风机软件平台
*  Date       : 09/01/2022
*  Description: 本页参数为电机FOC控制相关参数
								包括但不限于：无感启动参数、电流环参数、观测器参数等。
**             
//---------------------------------------------------------------------------//
******************************************************************************/
//===========================================================================//

#ifndef  __SET_FOC_H__
#define  __SET_FOC_H__

//============================================================================/
// 代码对齐方式：Edit--Configuration--Editor--C/C++Files--Tab size = 2
//----------------------------------------------------------------------------/

//===========================================================================//
//-------------------------------运行方式选择----------------------------------/
#define	  RUN_MD_LHALL												  (1)										  //有感运行
#define	  RUN_MD_SENSORLESS											(2)											//无感运行(启动都用观测器1)
#define		Config_Run_Mode                       (RUN_MD_SENSORLESS)     

//-------------------------------观测器选择----------------------------------/
#if(Config_Run_Mode == RUN_MD_SENSORLESS)
#define		Run_OBSER1														(1)											// 运行观测器1  
#define		Run_OBSER2														(2)											// 运行观测器2  
#define		Run_OBSER3														(3)											// 运行观测器3   
#define		Config_Obser_Run											(Run_OBSER2)
#endif
//===========================================================================//
//-------------------------------基值配置----------------------------------/
#define		V_PHASE_BASE													(float)(10.0)						  //  相电压基值   单位 V
#define		MECH_SPEED_BASE												(float)(30000.0)						//	机械速度基值   单位 RPM
    
//-------------------------------电机参数----------------------------------/

//灵心巧手
#define		MOTOR_PAIRS														(2)											// 电机极对数
#define		MOTOR_RS															((4.7/4)/2)			    		  // 相电阻 单位 Ω
#define		MOTOR_LD															(0.066/2)			      		// d轴电感     15  单位 mH  
#define		MOTOR_LQ															(0.088/2)			      		  // q轴电感     21  单位 mH  
#define		MOTOR_KE															(0.24373)               		// 反电动势常数  单位 V/kRPM   




// 注：反电势常数可由如下公式进行计算
// MOTOR_VPP * MOTOR_PAIRS * 1000 / (2* _SQRT_3 ) / (60 * MOTOR_Freq)
// MOTOR_VPP为测量反电势峰峰值，MOTOR_Freq为测量反电势频率
//-------------------------------补偿角----------------------------------/
#define		FOC_OFFSET_ANGLE											(0)											// FOC补偿角 单位：° 范围-180~180°

//-------------------------------最大占空比----------------------------------/
#define		MAX_MODULATE													_Q15(0.7)


 

//===========================================================================//
//-------------------------------启动参数----------------------------------/
// 对齐电流 
#define   ALIGN_CUR_MIN                         (0.1)										// 最小对齐电流   单位 A
#define   ALIGN_CUR_MAX                         (0.2)										// 最大对齐电流   单位 A
#define   ALIGN_CUR_INC                         (0.001)								// 对齐电流增量      单位:  A/Ts
#define   ALIGN_CUR_INC_INTERVAL                (1)											// 对齐电流增加间隔  单位： Ts（开关周期）                         
#define   ALIGN_TIME                            (1.0)										// 对齐时间          单位： s  

//------------------------------------------------------------------------/
// 启动电流 
#define   START_CUR_MIN                         (0.2)										// 最小启动电流   单位 A
#define   START_CUR_MAX                         (0.4)										// 最大启动电流   单位 A
#define   START_CUR_INC                         (0.001)									// 启动电流增量      单位:  A/Ts
#define   START_CUR_INC_INTERVAL                (1)											// 启动电流增加间隔  单位： Ts（开关周期）   
//------------------------------------------------------------------------/
// 启动自适应率
#define   START_ADP_MAX                         (20000)									// 最大启动自适应率                               
#define   START_ADP_MIN                         (3)											// 最小启动自适应率
//------------------------------------------------------------------------/
// 启动状态机跳转条件
#define   START_SPEED_CLOSE                  		(300)										// 启动成功判定转速	单位RPM
#define   START_HOLD_TIME                       (0.3)										// 闭环保持时间	单位  s 
#define   SWITCH_HOLD_TIME                      (0.1)										// MC_SW状态机的保持时间	单位  s 

//===========================================================================//
//电流环参数
#define  CURRENT_BY_FORMULA											(0)
#define  CURRENT_BY_EXPERIENCE                  (1)
#define  CURRENT_MODE														(CURRENT_BY_FORMULA)

#if(CURRENT_MODE==CURRENT_BY_FORMULA)
	#define   RUN_IDQ_FC														(150)										// 运行电流环带宽
#else
	//运行电流环参数
	#define 	RUN_QKP																_Q12(0.8)     
	#define 	RUN_QKI																_Q15(0.03)

	#define 	RUN_DKP  															_Q12(0.8)     
	#define 	RUN_DKI     													_Q15(0.03)
#endif
//电流环输出限制
#define   RUN_DOUT_MAX													(MAX_MODULATE)							// D轴PI参数：最大输出                                
#define   RUN_DOUT_MIN													(-MAX_MODULATE)							// D轴PI参数：最小输出 
#define   RUN_QOUT_MAX													(MAX_MODULATE)							// Q轴PI参数：最大输出                                
#define   RUN_QOUT_MIN													(-MAX_MODULATE)							// Q轴PI参数：最小输出 


//------------------------------------------------------------------------/
// 启动的锁相环参数 
#define   START_PLLKP                           _Q15(0.1)							// 锁相环比例系数                               
#define   START_PLLKI                           _Q15(0.001)						// 锁相环积分系数      

//------------------------------------------------------------------------/
// 运行的锁相环参数 
#define   RUN_PLLKP															_Q15(0.1)								// 运行的锁相环PI参数：Kp                               
#define   RUN_PLLKI															_Q15(0.001)							// 运行的锁相环PI参数：Ki  

//===========================================================================//
//线性霍尔参数
#define   OMEGAPU_THRESHOLD											(5000)			      //霍尔学习成功判定转速的标幺值，当转速标幺值大于改值一定时间，则认为学习成功
#define   HALL_LEARN_CUR                        (0.15)						// 最大对齐电流   单位 A
//线性霍尔学习参数写入flash的起始地址
#define		FLASH_PARA_ADDR    										(0xF500)          // F000 ->60k      F500 ->63k
//------------------------------------------------------------------------/
// 线性霍尔的锁相环参数 
#define   LHALL_PLLKP														_Q15(0.05)								// 运行的锁相环PI参数：Kp                               
#define   LHALL_PLLKI														_Q15(0.001)							// 运行的锁相环PI参数：Ki 







#define    ENCODER_OFFSET												(260)





#endif


/******************************** END OF FILE *******************************/
