
//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    MC_Wind.c
* @author  CMS_Motor_Control_Team
* @version 第三代电机平台
* @date    2024年6月
* @brief   该文件主要存放顺逆风启动代码
*---------------------------------------------------------------------------//
*****************************************************************************/
//==========================================================================//


//---------------------------------------------------------------------------/
//	include files
//---------------------------------------------------------------------------/
#include "Header_Motor.h"
#include "Header_MCU.h"
#include "Header_User.h"
//---------------------------------------------------------------------------/
//	Local pre-processor symbols/macros('#define')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local variable  definitions
//---------------------------------------------------------------------------/


//---------------------------------------------------------------------------/
//	Global variable definitions(declared in header file with 'extern')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local function prototypes('static')
//---------------------------------------------------------------------------/


//===========================================================================/
//***** definitions  end ****************************************************/
//===========================================================================/
Struct_Wind Stru_Wind;



/*****************************************************************************
* Function Name  : Wind_CtrlInit
* Description    : 顺逆风结构体初始化   每次启动前调用
* Function Call  : 
* Input Paragram : none
* Return Value   : none
* note           : 
* Version        : V0.1    2024/07/03    新建			Wj
******************************************************************************/
void Wind_CtrlInit()
{
		
	Stru_Wind.State = SPEED_OB;
	Stru_Wind.Cnt_LowSPeedJudge = 0;						//低速判定计数器
	Stru_Wind.Cnt_TailWindJudge = 0;						//顺风判定计数器
	Stru_Wind.Cnt_HeadWindJudge = 0;						//逆风判定计数器
	Stru_Wind.Cnt_HighSpeedJudge = 0;						//高速判定计数器
	Stru_Wind.Cnt_StillJudge = 0;							//静止判定计数器
	Stru_Wind.ThetaTotal = 0;								  //一段时间内，观测器输出的角度总和
	Stru_Wind.ThetaMax = 0;										//一段时间内，观测器角度的最大值
	Stru_Wind.ThetaMin = 0;										// 一段时间内，观测器角度的最小值
	Stru_Wind.Ed = 0;													//d轴反电动势   PUQ15
	Stru_Wind.Eq = 0;												  //q轴反电动势   PUQ15
	Stru_Wind.Ud = 0;													//强顺风切入时的d轴端压	 			PUQ15	
	Stru_Wind.Uq = 0;													//强顺风切入时的q轴端压				PUQ15
}
/*****************************************************************************
* Function Name  : Wind_ParaInit
* Description    : 顺逆风结构体初始化   上电时调用
* Function Call  : 
* Input Paragram : none
* Return Value   : none
* note           : 
* Version        : V0.1    2024/07/03    新建			Wj
******************************************************************************/
void Wind_ParaInit()
{
	Stru_Wind.Kp = WIND_KP;
	Stru_Wind.LowSpeedJudgeThreshold = LOWSPEED_THRESHOLD/Stru_BaseValue.MechSpd*32768;			//低速判定    速度阈值
	Stru_Wind.StillJudgeThreShold_ThetaError = STILL_JUDGE_THETAERROR/360*65536;		//静止判定  deltaTheta   
	Stru_Wind.StillJudgeThreShold_Cnt = STILL_JUDGE_TIME*EPWM_FREQ;					//静止判定  Cnt    		
}






/******************************** END OF FILE *******************************/

