//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    MC_Wind.h
* @author  CMS_Motor_Control_Team
* @version 第三代电机平台
* @date    2024年6月
* @brief   
*---------------------------------------------------------------------------//
*****************************************************************************/

//==========================================================================//

#ifndef __MC_WIND_H
#define __MC_WIND_H

/*****************************************************************************/
/* Include files */
/*****************************************************************************/
#include <stdint.h>

/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define') */
/*****************************************************************************/




/*****************************************************************************/
/* Global type definitions ('typedef') */
/*****************************************************************************/




typedef enum
{
	SPEED_OB            				 = 0,                        //  速度观测                 
	LOWSPEED           	 				 = 1,                        //  低速
	TAILWIND           					 = 2,                        //  顺风高速
	HEADWIND           					 = 3,                        //  逆风高速
}WindState_e; 


typedef struct
{
	WindState_e State;										//顺逆风状态机

	int32_t  Kp;													//比例系数
	
	
	int32_t  LowSpeedJudgeThreshold;			//低速判定    速度阈值
	int32_t  Cnt_LowSPeedJudge;						//低速判定计数器
	int32_t  Cnt_TailWindJudge;						//顺风判定计数器
	int32_t  Cnt_HeadWindJudge;						//逆风判定计数器
	
	int32_t  Cnt_HighSpeedJudge;					//高速判定计数器
	
	int32_t  StillJudgeThreShold_ThetaError;		//静止判定  deltaTheta   
	int32_t  StillJudgeThreShold_Cnt;						//静止判定  Cnt    				
	int32_t  Cnt_StillJudge;							//静止判定计数器
	
	
	
	int32_t  ThetaTotal;									//一段时间内，观测器输出的角度总和
	int32_t  ThetaMax;										//一段时间内，观测器角度的最大值
	int32_t  ThetaMin;										// 一段时间内，观测器角度的最小值
	
	
	int32_t  Ed;													//d轴反电动势   PUQ15
	int32_t  Eq;												  //q轴反电动势   PUQ15
	
	int32_t  Ud;													//强顺风切入时的d轴端压	 			PUQ15	
	int32_t  Uq;													//强顺风切入时的q轴端压				PUQ15
}Struct_Wind;


/*****************************************************************************/
/* Global variable declarations ('extern', definition in C source) */
/*****************************************************************************/
extern Struct_Wind Stru_Wind;

/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source) */
/*****************************************************************************/
void Wind_CtrlInit(void);
void Wind_ParaInit(void);
/*****************************************************************************/
/* Intrinsic function definition ('__inline', definition in Header File) */
/*****************************************************************************/


/*****************************************************************************/
/* Macro Definition function definition ( definition in Header File) */
/*****************************************************************************/

#endif


/******************************** END OF FILE *******************************/

